# Data analysis tools 2
**Lecture and exercises for week 6B** in Digital Methods, University of Copenhagen

*Note: Due to the sudden demand for remote learning, we are experimenting with different ways of creating a good
remote learning experience. Therefore your feedback and suggestions are encouraged. You can give feedback
anonymously through [this web form](https://ulfaslak.com/vent) or reach out to a teacher. This notebook contains
bits of lecturing and exercises interweaved. There is no seperate lecture file, everything you need is in here.
Later this week I will upload solutions possibly in video format, explaining the solutions. It is important to note
that we will probably iterate on this format, so we ask for your patience if we mess up.*

***Also, due to this special format, it is important you DON'T SKIP AHEAD and go straight for the exercises. Try
to consume the content of this notebook in the order it is presented, otherwise you may miss important points
that we, for obvious reasons, cannot communicate in person.***

In [1]:
from IPython.display import HTML

def video_html(url):
    return f"""
    <div align="middle">
    <video width="50%" controls>
      <source src="{url}" type="video/mp4">
    </video></div>"""

## 1. `NumPy` + `pandas` = ❤️
### *(a brief primer)*

When manipulating data in Python, NumPy and pandas are your go-to tools. Numpy is an extremely fast *low-level*
library for manipulating N-dimensional *arrays* (from lists (1D), to tables (2D), to boxes (3D), etc.). It also
contains a bunch of mathematical tools for advanced analysis. pandas is a fast *high-level* library for manipulating
series (1D) and tables (2D). It let's you do a lot of very sophisticated data manipulation operations without
a whole lot of code (hence the term *high-level*). In summary:
* **NumPy** is the fundamental package for scientific computing with Python.<br>
* **pandas** is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool

Friedolin gave you a nice introduction to these libraries last week, but **for a short recap, watch the video below**.

In [2]:
HTML(video_html('https://www.dropbox.com/s/5vbwkjzd6nrk24g/1_numpy_and_pandas_min.mov?raw=1'))

### Own notes for video above
All objects in NumPy are stored as arrays
- NumPy is fast because it utilizes C/C++ and Fortran, which is faster than Python (since they are lower level languages)

Pandas is better for two-diomensional analysis (like tables)
- It actually uses a lot of numpy as lower level building blocks, and kind of layers on top of it. But it is also much more than just a layer.
- Indices in NumPy works with rows and numbers. But in pandas you can call rows and columns specific things
- The reshaping and pivoting functions in pandas is the same as broadcasting functions in numpy, but is named differently
- Perfect mutability as well
- We are going to look at group by, slicing, merging and joining today.

And here is a quick demonstration of how to use NumPy and pandas in Python.

In [3]:
HTML(video_html('https://www.dropbox.com/s/1d0l26ilr80ez31/2_numpy_and_pandas_example_min.mov?raw=1'))

In [5]:
#Following the video examples
import numpy as np
import pandas as pd

In [18]:
arr = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
    
]

arr = np.array(arr) #This makes it a numpy array, and defines it as arr (overriding the old arr)

# arr = pd.DataFrame(arr) #This makes the numpy array a pandas dataframe, and defines it as arr (overriding)
arr = pd.DataFrame(arr, index=['cats', 'dogs', 'giraffes'], columns=['age', 'height', 'name']) #Trying to add index and column labels to our arr
arr

          age  height  name
cats        1       2     3
dogs        4       5     6
giraffes    7       8     9

In [13]:
#?pd.DataFrame #Prints helptext for the DataFrame function. For example we can see that we can input, columns, index, etc.

> **Ex. 1**: Import `numpy`. Use the `np.random.randint` function to create a 10 by 2 array of random integers.
Display this array.
>
> *Hint: Remember you can do`?np.random.randint` to display the documentation. Read about the `size` argument.
It says to pass it a "tuple". A tuple is like a list, only it uses parentheses, not square brackets. Try passing
it the tuple `(10, 2)`.*

In [20]:
random = np.random.randint(2,size=(2,10))

> **Ex. 2**: Import `pandas`. Load the array you just created as a `pd.DataFrame`. Name the row and column indices
(anything you like). Display this DataFrame.

In [24]:
coffee = pd.DataFrame(random, index=['Arabica', 'Robusta'], columns=['Nicaragua', 'Ecuador', 'Denmark', 'Mexico', 'Venezuela', 'Germany', 'USA', 'Ivory Coast', 'Samoa', 'Equiotorial Guinnea'])
coffee

,Nicaragua,Ecuador,Denmark,Mexico,Venezuela,Germany,USA,Ivory Coast,Samoa,Equiotorial Guinnea
Arabica,1,0,1,1,0,1,0,1,1,1
Robusta,0,1,1,0,0,0,0,0,1,1

> **Ex. 3**: Turn the DataFrame back into an array! Display the type of the resulting array. What does this reveal
about the connection between pandas and NumPy?
>
> *Hint: You can do this by getting it's `values` attribute. To get an attribute from an object, you use the "dot-
operator". Like `object.attribute`.*

In [30]:
coffee = np.array(coffee)
coffee

array([[1, 0, 1, 1, 0, 1, 0, 1, 1, 1],
       [0, 1, 1, 0, 0, 0, 0, 0, 1, 1]])

## Merging/joining datasets

It's not uncommon that we need to stick to pieces of data together to make a new table. Sometimes merging data is
straight forward, both pieces have the same shape and we can just slab one on top of the other and all is good. But
other times, one piece has more, fewer or different columns. Sometimes, data points in either dataset needs to be
merged somehow. **In the video below we have look at different cases and how to manage them**.

In [31]:
HTML(video_html('https://www.dropbox.com/s/qprehqimhkp9lpe/3_joining_data_min.mov?raw=1'))

### Own notes for video above

#### Merging data in pandas
`concat` function
- Put different dataframes in a list, then use `pd.concat(list)`. In case the datasets are indexed the same way.
- It can be useful to add keys that indicate different datasets (e.g. first dataset has x, second y, third z)


When datasets are indexed differently, you have to make choices in how to concatenate them. E.g. they have different number of columns
- Different types of concatenation
    - Outer join (dataset will contain all data. Means that duplicate rows with same column value will become two rows. Will not lose any information with this type)
    - Inner join (only keep rows that are the same. Conservative, and throws away anything that is not the same between the two datasets)
    - Left/right join (left: will keep everything from first dataset, and throw away everything from second dataset that is not in the first dataset. Right is just the other way around)
- Default in pandas is outer join. Concatenating on axis 1 means that we want to create a wider array/dataframe. Preserves all data. Columns where rows from one dataset doesn't have any data will become NaN.
    - But because we keep everything, we can end up with two columns that contain the same information. This has some function though, since concatenating vertically (=deleting duplicate columns) can result in overwriting data. 
        - For example if the price of cherrys in dataset 1 is 5£ and 10£ in dataset 2, we would only end up with one of the values if we used axis = 0. If we used axis = 1 we would get two columns with different prices for cherries, but would have both price values at hand.
- If we do an inner join, we only keep rows that are in both datasets. Inner join does not merge inside individual rows, therefore it creates new columns (duplicates)

Also watch this video where I give **some examples** of how to merge data in pandas.

In [32]:
HTML(video_html('https://www.dropbox.com/s/qj85zi8yq6jbrxp/4_joining_data_example.mov?raw=1'))

> **Ex. 4**: Consider the two pandas dataframes `df1` and `df2` below.

In [33]:
df1 = pd.DataFrame(
    np.random.randint(0, 10, size=(3, 4)),
    index=[0, 1, 2], columns=['a', 'b', 'c', 'd']
)

df2 = pd.DataFrame(
    np.random.randint(0, 10, size=(5, 3)),
    index=[1, 2, 3, 4, 5], columns=['c', 'd', 'e']
)

In [34]:
df1

   a  b  c  d
0  5  2  5  9
1  0  7  6  7
2  6  2  2  8

In [35]:
df2

   c  d  e
1  6  1  3
2  2  1  2
3  1  3  4
4  1  9  3
5  6  0  8

> Join `df1` and `df2` (using `pd.concat`) with argument `axis=1`.
>
> 1. What is the resulting shape if you merge them using an outer join?
> 1. What is the resulting shape if you merge them using an inner join?

In [48]:
#Outer join, axis = 1
dfouter = pd.concat([df1, df2], axis=1)
#dfouter
#The resulting shape is a wider dataframe, that has duplicate columns, where some have no values.
#All rows are saved.

#Inner join, axis = 1
dfinner = pd.concat([df1, df2], axis=1, join='inner')
#dfinner
#Still a wide dataframe, but now we only have the two rows that are in both datasets(1 and 2). 
#A lot of data has been deleted in the merge. But we still have the duplicate columns like the outer join.

dfouter

     a    b    c    d    c    d    e
0  5.0  2.0  5.0  9.0  NaN  NaN  NaN
1  0.0  7.0  6.0  7.0  6.0  1.0  3.0
2  6.0  2.0  2.0  8.0  2.0  1.0  2.0
3  NaN  NaN  NaN  NaN  1.0  3.0  4.0
4  NaN  NaN  NaN  NaN  1.0  9.0  3.0
5  NaN  NaN  NaN  NaN  6.0  0.0  8.0

> **Ex. 5**: Again, use `pd.concat` to outer join `df1` and `df2`, but this time use `axis=0`.
> 1. Qualitatively, what is the difference now that `axis=1`, compared to when `axis=0`? You can for examlpe
display the two results side by size and try to spot the pattern difference.
> 1. Read about the `axis` argument (remember you can use `?pd.concat` to launch the docs). Does this correspond
with your understanding? Can you predict what an inner join of `df1` and `df2` with `axis=0` would look like?

In [52]:
#Outer join, axis = 0
dfouter2 = pd.concat(
    [df1, df2],
    axis = 0,
    join = 'outer'
)
dfouter2
#When using axis = 0 we get a narrower and taller dataframe. 
#You can tell the two datasets have been stacked on top of each other, vertically
#We now do not have duplicate columns, but instead duplicate rows with different information in them.

#2
#If we did an inner join with axis = 0 instead, we would still have a narrow and tall dataset.
#But we would only have columns c and d, because they are the only columns that are in both datasets.
#So, with inner join, axis = 0 gives less columns, axis = 1 gives less rows

     a    b  c  d    e
0  5.0  2.0  5  9  NaN
1  0.0  7.0  6  7  NaN
2  6.0  2.0  2  8  NaN
1  NaN  NaN  6  1  3.0
2  NaN  NaN  2  1  2.0
3  NaN  NaN  1  3  4.0
4  NaN  NaN  1  9  3.0
5  NaN  NaN  6  0  8.0

> **Ex. 6**: So we have learned that in pandas, anything can be concatenated. That's not the case in NumPy!
Consider the two arrays below `arr1` and `arr2`.

In [53]:
arr1 = np.random.randint(0, 10, size=(3, 4))
arr2 = np.random.randint(0, 10, size=(3, 3))

> 1. Use `np.vstack` to concatenate `arr1` and `arr2` below. What does the error say? And why?
> 1. Now use `np.hstack` to concatenate `arr1` and `arr2`. It works! But why?

In [60]:
#1
#arr = np.vstack((arr1,arr2))
# It ways the array dimensions has to match exactly (which they don't, arr1 has a column more than arr2)

#2
arr = np.hstack((arr1,arr2))
# It works because there are the same amount of rows in both datasets, so it just adds the columns from arr2 to each row

array([[1, 2, 6, 7, 7, 5, 7],
       [1, 2, 2, 5, 8, 7, 3],
       [3, 6, 2, 2, 0, 3, 2]])

## Summary statistics

It is useful to be able to summarize a dataset in a few key numbers. *Summary statistics*
does that for us. pandas has a set of nice tools to make this very easy! First let's load
some data

In [61]:
# Import
from sklearn.datasets import load_wine #sklearn.datasets is a dataset collection

# Structure as pd.DataFrame
data = load_wine()
wine_df = pd.DataFrame(data['data'], columns=data['feature_names'])

# display
wine_df.head() #only shows 5 first values (there are 173 rows of wine)

,alcohol,malic_acid,ash,alcalinity_of_ash,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,od280/od315_of_diluted_wines,proline
0,14.23,1.71,2.43,15.6,127.0,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065.0
1,13.20,1.78,2.14,11.2,100.0,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050.0
2,13.16,2.36,2.67,18.6,101.0,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185.0
3,14.37,1.95,2.50,16.8,113.0,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480.0
4,13.24,2.59,2.87,21.0,118.0,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735.0

This dataset contains information and measurements on 173 Italian wines. Read the column
names and look at the values and try to make sense of it. What are typical values for each
feature? How much do they deviate? What's the lowest they get? etc. Here's a short video 
where I explain different statistics:

In [62]:
HTML(video_html('https://www.dropbox.com/s/bwlhgpwcbq3652l/5_summary_statistics.mov?raw=1'))

### Own notes for video above
`.describe` method shows summary statistics for each column (e.g. count, mean, standard deviation. min cvalue, etc.)
- Std (standard deviation) shows how spread out values are. In theory, 68% of the data is within the mean +- std (if distribution is normal). Therefore, 68% of wines have an alcohol percentage of 13.000618 which is the mean.
- Min/max. Minimum and maximum values in a column.
- Percentiles (25/50/75). Orders the variable, and record values at the different percentiles. Common word for 50% percentile is the median. Is mean and median is very close it indicates that the distribution is close to normal

> **Ex. 7**: If you followed my instructions above, you should hopefully felt that staring
at data like that isn't the most meaningful way to spend your time. So go ahead and run
`wine_df.describe()`. What does it show?
1. Explain what the *mean* and *std* values tell you about. Inside which range of alcohol
content does 68% of the data lie?
1. Explain what *min*, *max* and the *25%*, *50%*, and *75%* values mean.
1. What is another common word for the *50%* value?

In [63]:
wine_df.describe()

#1
#68% of the wines are within mean+-std, which in this case is 13.000618 + or - 0.811827. 
#So 68% of wines are within the range of [12.188791; 13.812445]

#2
#Min is the lowest value of the dataset in that column, max is the maximum.
#The percentiles tells us that if we line up the data from min -> max, the value at 25% is x, at 50% is y, at 75% is z.

#3
#Another common word for the 50% percentile is the median.

,alcohol,malic_acid,ash,alcalinity_of_ash,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,od280/od315_of_diluted_wines,proline
count,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000
mean,13.000618,2.336348,2.366517,19.494944,99.741573,2.295112,2.029270,0.361854,1.590899,5.058090,0.957449,2.611685,746.893258
std,0.811827,1.117146,0.274344,3.339564,14.282484,0.625851,0.998859,0.124453,0.572359,2.318286,0.228572,0.709990,314.907474
min,11.030000,0.740000,1.360000,10.600000,70.000000,0.980000,0.340000,0.130000,0.410000,1.280000,0.480000,1.270000,278.000000
25%,12.362500,1.602500,2.210000,17.200000,88.000000,1.742500,1.205000,0.270000,1.250000,3.220000,0.782500,1.937500,500.500000
50%,13.050000,1.865000,2.360000,19.500000,98.000000,2.355000,2.135000,0.340000,1.555000,4.690000,0.965000,2.780000,673.500000
75%,13.677500,3.082500,2.557500,21.500000,107.000000,2.800000,2.875000,0.437500,1.950000,6.200000,1.120000,3.170000,985.000000
max,14.830000,5.800000,3.230000,30.000000,162.000000,3.880000,5.080000,0.660000,3.580000,13.000000,1.710000,4.000000,1680.000000

## Group-by operations

Often times we have some data, and need to know e.g. the average of every datapoint
that matched a certain criteria. Or our datapoints are categorized by some variable
(e.g. *sex* categorizes people into *male*, *female* and sometimes *non-binary*), and we want
to count how many datapoints that fall in each category. Then we use *group-by*!

We are going to use the Titanic dataset for this exercise. Each row is a passanger, and each
column describes a feature of the passangers. Please stare at it in silence for 2 minutes, and
then watch the video below.

In [64]:
titanic_df = pd.read_csv('https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv')
titanic_df

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
...,...,...,...,...,...,...,...,...
882,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.0000
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.0000
884,0,3,Miss. Catherine Helen Johnston,female,7.0,1,2,23.4500
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.0000
886,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.7500

In [65]:
HTML(video_html('https://www.dropbox.com/s/yejuzmw7x0vw14r/6_groupby.mov?raw=1'))

### Own notes for video above

You could use `.describe()` here, but we will instead go one step deaper using `.groupby()`
- E.g. using `.groupby('Sex').mean()['Age']`
    - Prints the mean ages for males vs. females
    - If we remove Age, we get means across all columns instead. Shows pretty significant differences between sexes.
        - Could also use Pclass instead of Sex to see survivability rate between different classes
    - You can also group by multiple variables, e.g. Pclass and Sex: `.groupby(['Pclass', 'Sex'])`. Shows that females at first class almost always survived, whereas only 50% of females at third class survived

> **Ex. 8**: Use the `groupby` operation to get the *mean* feature values of survivors and non-survivors.
* How big is the age difference?
* What about the 'Pclass' (low values closer to first class)? 
* Number of siblings/spouses aboard?
* Parents/children aboard?
* Ticket price (fare)?
>
> Do you see any systematic differences between survivors and non-survivors?

In [66]:
titanic_df.groupby('Survived').mean() #Prints means across columns grouped by survivors and non-survivors.

# Age difference: roughly two years
# Pclass: People closer to first class more likely to survive. (lower is closer to first class)
# Sublings/spouses: people with siblings/spouses less likely to survive
# Parents/children: people with parents/children aboard less likely to survive
# Fare: the higher the price the higher you are to likely survice. (this is basivally just another measure of Pclass)

# Systematic differences: having family onboard decreases likelihood of survival, but also the class you are seated in.

,Pclass,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
Survived,,,,,
0,2.528440,30.138532,0.557798,0.332110,22.208584
1,1.950292,28.408392,0.473684,0.464912,48.395408

> **Ex. 9**: Try grouping on both 'Survived' and 'Sex', and then `count`ing the number of
rows in either group and subgroup. Do you see a pattern in who survives and who does not?

In [74]:
titanic_df.groupby(['Survived', 'Sex']).count()

# Very strong pattern that males with family onboard died. 
# On the other hand, women with family onboard most likely to survive. Probably because family males sacrificed themselves.

                 Pclass  Name  Age  Siblings/Spouses Aboard  \
Survived Sex
0        female      81    81   81                       81
         male       464   464  464                      464
1        female     233   233  233                      233
         male       109   109  109                      109

                 Parents/Children Aboard  Fare
Survived Sex
0        female                       81    81
         male                        464   464
1        female                      233   233
         male                        109   109